Revit 2024 API
FieldDomainPointsByParameter Members
The FieldDomainPointsByParameter type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByParameter
 Creates object from an array of one-dimensional point coordinates
Methods
Name | Description
Dispose |  (Inherited from FieldDomainPoints.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FieldDomainPoints.)
See Also
FieldDomainPointsByParameter Class
Autodesk.Revit.DB.Analysis Namespace